import React from 'react';

export default function About() {
    return (
        <div className="card border-0">
            <div className="card-body">
            <strong>Хуст</strong> (угор. Huszt, словац. Chust, нім. Chust, рум. Hust, їд. חוסט‎) — місто в Закарпатській області України, 
            центр Хустської міської громади та Хустського району. Географічно місто розташоване в Карпатах у Верхньотисинській 
            улоговині у місці впадіння Ріки до Тиси. 2011 року <strong>чисельність</strong> населення становила <strong>28 438 осіб</strong>.
            </div>
            <div className="card-body pt-0">
            На окраїні населеного пункту височить гора вулканічного походження, на якій 1090 року почалось будівництво замку-фортеці 
            (тепер у руїнах). Замок слугував для охорони шляху до копальні солі в Солотвині. У XVI—XVII століттях за Хуст і його замок 
            часто воювали Габсбурги і семигородські князі, на нього здійснювали напади турки і татари. 1709 року Ференц Ракоці скликав 
            у Хусті семигородський сейм. 1766 року замок знищили удар блискавки і пожежа.
            </div>
            <div className="card-body pt-0">
            15 березня 1939 року тут зібрався Сойм Карпатської України, який проголосив незалежність Карпато-Української республіки. 
            Хуст був свідком її національно-державного відродження та збройної боротьби між Карпатською Січчю та чеськими й угорськими військами.
            </div>
        </div>
    )
}