import React from 'react';

export default function History() {
    return (

        <div className="card border-0">
            <h1 className="text-center p-4">Історія</h1>
            <div className="card-body">
                Територію, на місці якої виникло місто, заселили ще з найдавніших часів.
                Археологічні розкопки, які проводила Академія наук УРСР у 1947—1961 роках, встановили,
                що в <strong>І столітті</strong> тут проживали носії <strong>культури карпатських курганів.</strong>
            </div>
            <div className="card-body pt-0">
            Місто виникло і розвивалося біля підніжжя замкової гори як посад і торговий центр широкої 
            землеробської округи і один із <strong>центрів</strong> на <strong>«соляному шляху»</strong> із солотвинських соляних шахт в 
            Дунайську улоговину. Архівні джерела стверджують, що Хустський замок побудували для захисту 
            східної частини Угорської держави та для приборкання переможених русинів, а будівництво 
            розпочалося <strong>1090 р.</strong> і закінчено за правління короля <strong>Бели ІІІ 1191 року.</strong>
            </div>
            <div className="card col border-0">
                <div className="row no-gutters">
                    <div className="col-md-4">
                        <img src="../img/grav.jpg" className="card-img" alt="..." />
                    </div>
                    <div className="col-md-8 ">
                        <div className="card-body py-0 m-0">
                            <p className="card-text">Згодом у Хустському замку розташувався королівський 
                            гарнізон, який очолював комендант фортеці. 1577 р. місцевий замок був значно 
                            укріплений, збудовані окремі фортифікаційні споруди. До замку із заходу, від 
                            річки Хустця, вела серпантинна дорога. На півдорозі до фортеці, де на південній 
                            частині гори починався крутий схил, стояв сторожовий будинок, руїни якого помітні 
                            і зараз. Тут розміщувалася сторожа. З цього будинку до замку вів підземний коридор.
                             Отож замок був з'єднаний таємним ходом зі сторожовим пунктом.</p> 
                              <p className="card-text"> Круті схили Замкової гори робили неможливим штурм 
                              замку одночасно з усіх сторін. У 1594 році татарська орда хана <strong>Гази II Ґерая</strong> 
                              напала на Марамороську жупу, дуже її пограбувала, але замок взяти не змогла.</p>
                        </div>
                    </div>

                </div>
            </div>   
            <h5 className="px-3">Новий час</h5>
            <div className="card-body">
            1660 року турецьке військо вторглося в Мараморощину. Трансільванський князь Янош Кемені при 
            підтримці австрійського імператора Леопольда І, який надіслав йому німецький гарнізон, укріпився 
            в Хустському замку. Фортеця в той час була настільки могутньою, що турки не насмілилися брати її
             штурмом, а відправили для переговорів делегацію, в складі якої був відомий турецький мандрівник 
             Евлія Челебі. Він є автором 10 томів «Книги подорожей», де розповідається і про перебування 
             турецької армії в 1660—1666 рр. на території Угорщини, зокрема на Закарпатті. Переговори успіху 
             не мали. Турки відступили з Хуста на захід, руйнуючи закарпатські села.
            </div>
            <div className="card col border-0">
                <div className="row no-gutters">
                    <div className="col-md-4">
                        <img src="../img/xvii_xviii.gif" className="card-img" alt="..." />
                    </div>
                    <div className="col-md-8 ">
                        <div className="card-body py-0 m-0">
                            <p className="card-text">З другої половини XVII століття відомий найдавніший <strong>герб 
                            Хуста</strong>: на блакитному тлі — дві перехрещені срібні стріли, супроводжувані срібним 
                            півмісяцем і двома шестикутними золотими зірками.</p> 
                              <p className="card-text">На початку XVIII століття на території Закарпаття 
                              активно діяли повстанські загони <strong>опришків</strong> на чолі з Григором Пинтею, Федором 
                              Бойко, Іваном Бецею та іншими. Особливо активно діяв на території Східного 
                              Закарпаття загін «народних месників» Григора Пинті. Про повстанців Пинті 
                              народ створив багато переказів і пісень, особливо про його діяльність у 
                              районі Хустського замку. У переважній більшості народних творів говориться 
                              про зруйнування Пинтею замку, в якому проживали феодали, що гнобили селян.</p> 
                               <p className="card-text">1717 р. на Закарпаття здійснили останній напад татари.
                                12-тисячна орда з величезною здобиччю і багатотисячним натовпом невільників 
                                поверталася в Крим після наскоку на Дунайську низовину. Татари не наважилися 
                                напасти на замок і, пройшовши лівим берегом Тиси, намагалися без перешкод відійти 
                                в Крим. Та гарнізон Хустського замку сам зробив сміливу вилазку і біля села 
                                Вишкова завдав татарам поразки.</p>
                        </div>
                    </div>

                </div>
            </div>
            <div className="card-body">
            Руїни стали джерелом дешевого будівельного матеріалу. У 1799 було розібрано східну частину замку 
            для спорудження католицького костелу та різних державних будівель. Цікаво, що пам'ять про 
            руйнування замку 1766 було увічнено в новішому гербі Хуста, чинному у XIX — на початку XX 
            століття: на червоному тлі на зеленій горі руїни срібного замку з трьома вежами й трьома 
            бійницями. У XIX столітті Хуст перетворився на торгове містечко, будучи центром Хустського 
            повіту Марамороського комітату.
            </div> <h5 className="px-3">XX століття</h5>
            <div className="card-body">
            Після розвалу Австро-Угорської монархії з ініціативи українських сил (зокрема братів Юлія та 
            Михайла Бращайків) 21 січня 1919 року в Хусті відбувся Всенародний закарпатський конгрес, на 
            якому 420 делегатів з 175 населених пунктів Закарпаття прийняли історичне рішення: «До України!». 
            Та в силу історичних обставин весь край було прилучено до Чехословаччини.
            </div> 
              <div className="card-body py-0">
              Яскравим прикладом модернізації міста стало будівництво житлового кварталу (колонії) для 
              службовців місцевої адміністрації, що став відомий як <strong>«Масарикова колонія»</strong> (від імені 
              тогочасного президента Чехословаччини) або «чеське містечко». З ініціативою спорудження 
              будинків виступило Міністерство громадських робіт Чехословаччини. Розроблений проект передбачав 
              побудову 16 будинків, частина з яких — двоповерхові вілли, решта — були блокованими. Біля кожного
               будинку знаходився невеликий сад, який відділявся від сусідних виконаною з бетону та дерева 
               огорожею. Зодчі використовували в будівельному процесі традиційні місцеві матеріали — дерево,
                камінь, піщано-гравійну суміш і керамічне покриття. Стилістичний результат відобразив поєднання 
                модернізованих елементів та мотивів національної архітектури, слугуючи своєрідним маркером чеської 
                присутності в регіоні.
            </div>
            
        </div>
    );
}

