import React from 'react';

export default function Myth() {
    return (

        <div className="card border-0">
            <h1 className="text-center p-4">Легенди Хуста</h1>
            <h2 className=" p-2">Легенди про походження назви міста Хуст</h2>
            <div className="card-body">
                <strong>1.</strong> Якось <strong>нечистий</strong> вирішив залишити пекло та повернутися на землю. Пробив головою землю серед рівнини ж живописними краєвидами,
            але трапилася з ним біда – не зміг витягнути на поверхню кінчик хвоста. Що він тільки не робив, але витягти хвіст так і не вдалося.
            Від його зусиль вся рівнинна місцевість горбами та горами вкрилась. Нечистий з розпачу завив від болю так, що було чути в усіх
            куточках світу: “Ой, мій хвуст-хвуст-хвуст!..”. Долиною покотилося відлуння, його відчайдушного крику: “Хуст-хуст-хуст…”. Нині
            на тому місці, де з пекла вибрався нечистий, височить гора, а поселення, що зародилося навколо неї назвали <strong>Хустом</strong>.
            </div>
            <div className="card-body">
            <strong>2.</strong> Розповідають, що місто отримало назву на честь <strong>воєводи Хуста</strong>,
            що колись володів цими землями. Воєвода мав дружину та двох діточок – сина і доньку. У обох дітей були однакові родимки на
            плечах. Якось, за відсутності господаря, на замок <strong>напало татарське військо</strong> – дружину та сина забрали в полон, лише доньці
            вдалося сховатися. Засліплений горем воєвода Хуст заприсягнувся, що буде вбивати кожного татарина, якого зустріне на
            своєму шляху.
</div>
            <div className="card col border-0">
                <div className="row no-gutters">
                    <div className="col-md-4">
                        <img src="../img/casle4.jpg" className="card-img" alt="..." />
                    </div>
                    <div className="col-md-8 ">
                        <div className="card-body py-0 m-0">
                            <p className="card-text">
                            Пройшов час, полонений юнак добре зарекомендував себе і хан зробив його своїм охоронцем. Якось старенький 
                            раб-земляк умовив хлопчину втекти на батьківщину. Подолавши тисячі кілометрів, вони майже дісталися замку, 
                            але немічний старий не витримав тяжкої дороги і помер. Юнак продовжив свій шлях сам, раптом з лісу вибігла 
                            перелякана дівчина, яка відчайдушно втікала від розлюченого хижака. Хлопчина без вагань кинувся рятувати 
                            незнайомку і звалив звіра. В жорстокій боротьбі на оголеному плечі юнака дівчина побачила знайому родимку 
                            і зрозуміла, що це її рідний брат.                           
                            Воїни Хуста побачили, що молода княгиня обіймається з чоловіком в татарському одязі і знаючи, що воєвода 
                            заприсягнувся вбивати кожного татарина, якого зустріне на своєму шляху, схопили юнака і відрубали йому 
                            голову. На благання дівчини ніхто не звернув уваги.
                            </p>
                              <p className="card-text">
                              Коли воєвода під’їхав на місце страти і зрозумів, що трапилося, то з розпачу наклав на себе руки. Кров 
                              батька та сина змішалася і просочилася глибоко в скелю. Тепер в народі її називають Червоною скелею.
                            </p>
                            
                        </div>
                    </div>

                </div>
            </div>
           
            <div className="card-body">
            <strong>3.</strong> За однією з версій назва Хуст походить від слова <strong>“хустка”</strong>. Розповідають, що свого часу вартові передавали один одному 
            сигнали небезпеки, розмахуючи червоною хусткою.
            </div> 
             <div className="card-body">
            <strong>4.</strong> Місцеві розповідають, що колись місто було оточене густим лісом і назва “хуст” (або <strong>“густ”</strong>) походить саме від слова 
            “густий”.
            </div>  
              <div className="card-body">
            <strong>5.</strong> Назва міста походить з угорської мови і в перекладі означає<strong> “земля воєводи Густі”</strong>.
            </div>  
             <div className="card-body">
            <strong>6.</strong> Назва міста походить від назви невеликої річечки Хустець, що протікає через місто.
            </div>
        </div>
    );
}

