
export const MythsList = [
    {
        id: "1",
        name: "Легенда про хвіст",
        descr: ` Якось <strong>нечистий</strong> вирішив залишити пекло та повернутися на землю. Пробив головою землю серед рівнини ж живописними краєвидами,
        але трапилася з ним біда – не зміг витягнути на поверхню кінчик хвоста. Що він тільки не робив, але витягти хвіст так і не вдалося.
        Від його зусиль вся рівнинна місцевість горбами та горами вкрилась. Нечистий з розпачу завив від болю так, що було чути в усіх
        куточках світу: “Ой, мій хвуст-хвуст-хвуст!..”. Долиною покотилося відлуння, його відчайдушного крику: “Хуст-хуст-хуст…”. Нині
        на тому місці, де з пекла вибрався нечистий, височить гора, а поселення, що зародилося навколо неї назвали <strong>Хустом</strong>.
        </div> `,
        image:"../img/Kycb.jpg",

    }, 
     {
        id: "2",
        name: "Легенда про воєводу",
        descr: ` <p className="card-text">Розповідають, що місто отримало назву на честь <strong>воєводи Хуста</strong>,
        що колись володів цими землями. Воєвода мав дружину та двох діточок – сина і доньку. У обох дітей були однакові родимки на
        плечах. Якось, за відсутності господаря, на замок <strong>напало татарське військо</strong> – дружину та сина забрали в полон, лише доньці
        вдалося сховатися. Засліплений горем воєвода Хуст заприсягнувся, що буде вбивати кожного татарина, якого зустріне на
        своєму шляху.</p>
        <p className="card-text">
        Пройшов час, полонений юнак добре зарекомендував себе і хан зробив його своїм охоронцем. Якось старенький 
        раб-земляк умовив хлопчину втекти на батьківщину. Подолавши тисячі кілометрів, вони майже дісталися замку, 
        але немічний старий не витримав тяжкої дороги і помер. Юнак продовжив свій шлях сам, раптом з лісу вибігла 
        перелякана дівчина, яка відчайдушно втікала від розлюченого хижака. Хлопчина без вагань кинувся рятувати 
        незнайомку і звалив звіра. В жорстокій боротьбі на оголеному плечі юнака дівчина побачила знайому родимку 
        і зрозуміла, що це її рідний брат.                           
        Воїни Хуста побачили, що молода княгиня обіймається з чоловіком в татарському одязі і знаючи, що воєвода 
        заприсягнувся вбивати кожного татарина, якого зустріне на своєму шляху, схопили юнака і відрубали йому 
        голову. На благання дівчини ніхто не звернув уваги.
        </p>
          <p className="card-text">
          Коли воєвода під’їхав на місце страти і зрозумів, що трапилося, то з розпачу наклав на себе руки. Кров 
          батька та сина змішалася і просочилася глибоко в скелю. Тепер в народі її називають Червоною скелею.
        </p>`,
        image:"../img/casle4.jpg",
    },
     {
        id: "3",
        name: "Легенда про хустку",
        descr: `За однією з версій назва Хуст походить від слова <strong>“хустка”</strong>. Розповідають, що свого часу вартові передавали один одному 
        сигнали небезпеки, розмахуючи червоною хусткою.`,
        image:"../img/chustka1.jpg",
    },
     {
        id: "4",
        name: "Легенда про густ",
        descr: `Місцеві розповідають, що колись місто було оточене густим лісом і назва “хуст” (або <strong>“густ”</strong>) походить саме від слова 
        “густий”.`,
        image:"../img/forest.jpg",
    },
     {
        id: "5",
        name: "Легенда про угорське походження",
        descr: ` Назва міста походить з угорської мови і в перекладі означає<strong> “земля воєводи Густі”</strong>.`,
    },
     {
        id: "6",
        name: "Легенда про річку",
        descr: `Назва міста походить від назви невеликої річечки Хустець, що протікає через місто.`,
        image:"../img/river.jpg",
    },
];