import React from 'react';
import './Regalia.css';

export default function Regalia() {
    return (<div className="card-group">
    <div className="card ">
        <img src="../img/Hust_gerb.png" className="card-img-top gerb mt-3" alt="Герб Хуста" />
        <div className="card-body">
            <h5 className="card-title">Герб Хуста</h5>
            <p className="card-text">У сучасному гербі міста поєднано герби австрійського і радянського періодів. Сучасний герб являє собою щит на синьому полі якого дві срібні стріли перехрещені, срібний півмісяць і дві золоті шестипроменеві зірки, під якими розміщено золотий замок, у нижній частині якого посередині зображено коло з вписаною в нього срібною квіткою з червоною серединою, яка символізує долину нарцисів, що знаходиться біля міста. Вгорі на синій планці срібний напис з назвою міста — «ХУСТ». У синій хвилястій основі — срібні хвилі які символізують річки Тиса і Ріки.</p>
        </div>
    </div>
    <div className="card">
        <img src="../img/09904974.png" className="card-img-top flag mt-3" alt="Прапор" />
        <div className="card-body">
            <h5 className="card-title">Прапор</h5>
            <p className="card-text">Пра́пор — графічне зображення незалежної країни та її вільних громадян; полотнище правильної геометричної (найчастіше, прямокутної) форми, підвішене на жердині, або щоглі, що зображує певну комбінацію кольорів і символів та зазвичай використовується для ідентифікації (держав, регіонів, міст, організацій, військових з'єднань) та сигналювання. Вивченням прапорів займається наука вексилологія.</p>
        </div>
    </div>
</div>)
}